# coding=utf-8

# Title:乘法运算

# 给你两个整数a和b（0 < a,b < 1000),按笔算的格式输出a乘以b（a是被乘数，b是乘数）的运算过程，
# 最后再输出一行 “********************”（二十个星号）。
# 乘号用小写字母“x”表示，每行末尾不能有多余的空格。具体输出格式见下面的例子：
# 例1：
# a=89, b=13,则输出：
#       89
# x     13
# --------
#      267
#      89
# --------
#     1157
# ********************
# 例2：
# a=2, b=2,则输出：
#        2
# x      2
# --------
#        4
# ********************

# Test
a,b=2,2

# Answer
print ('% 8d'%a)  # 输出乘数
print ('x% 7d'%b) # 输出被乘数
c=b
print ('-'*8)     # 输出横线
i=8
while c>0:       # 被乘数有几位输出几次
    print ('% *d'%(i,(c%10)*a))# 从被乘数低位与乘数相乘
    c=c/10
    i-=1
if i==7:        # 输出结果
    print ('*'*20)
else:
    print ('-'*8)
    print ('% 8d'%(a*b))
    print ('*'*20)